Revit 2027 API
StructuralSectionRectangular.Width Property
 Section width.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Width { get; set; }
Public Property Width As Double
	Get
	Set
public:
property double Width {
	double get ();
	void set (double value);
}
member Width : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace